fe32/tutorials/rheoInterFoam/damBreak/Newtonian/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application directory
application=`getApplication`

runApplication blockMesh

cp 0/alpha1.org 0/alpha1

runApplication setFields

runApplication $application
