fe32/tutorials/rheoInterFoam/damBreak/Newtonian/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         Gauss linear;
 
}

divSchemes
{
    default                  none;
   
    div(rho*phi,U)           Gauss limitedLinearV 1;
    div(Sum(tau))            Gauss linear;
    div(phi,alpha)           Gauss vanLeer01;
    div(phirb,alpha)         Gauss interfaceCompression;         
}

laplacianSchemes
{
    default                             none;
    laplacian(eta,U)                    Gauss linear corrected;
    laplacian(pd|(ap-H1))               Gauss linear corrected;
    laplacian(pd|ap)                    Gauss linear corrected;
    laplacian((1|A(U)),pcorr)           Gauss linear corrected; 
        
}

interpolationSchemes
{
    default        linear;      
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
